samiparyal/LandslideEWS_lowpow/STM32_BLE/App/app_ble.c
#include <stdio.h>
#include <string.h>
#include "main.h"
#include "stm32wb0x.h"
#include "ble.h"
#include "gatt_profile.h"
#include "gap_profile.h"
#include "app_ble.h"
#include "stm32wb0x_hal_radio_timer.h"
#include "bleplat.h"
#include "nvm_db.h"
#include "blenvm.h"
#include "pka_manager.h"
#include "stm32_seq.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "landslide_service.h"
#include "imu.h"
#include "SEGGER_RTT.h"
#include "stm32_lpm.h"
#include "tilt_detector.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/**
 * Security parameters structure
 */
typedef struct
{
  uint8_t ioCapability;
  uint8_t mitm_mode;
  uint8_t bonding_mode;
  uint8_t encryptionKeySizeMin;
  uint8_t encryptionKeySizeMax;
  uint8_t initiateSecurity;
  /* USER CODE BEGIN tSecurityParams*/

  /* USER CODE END tSecurityParams */
}SecurityParams_t;

/**
 * Global context contains all BLE common variables.
 */
typedef struct
{
  SecurityParams_t bleSecurityParam;
  uint16_t gapServiceHandle;
  uint16_t devNameCharHandle;
  uint16_t appearanceCharHandle;
  uint16_t connectionHandle;
  /* USER CODE BEGIN BleGlobalContext_t*/

  /* USER CODE END BleGlobalContext_t */
}BleGlobalContext_t;

typedef struct
{
  BleGlobalContext_t BleApplicationContext_legacy;
  APP_BLE_ConnStatus_t Device_Connection_Status;
  /* USER CODE BEGIN PTD_1*/

  /* USER CODE END PTD_1 */
}BleApplicationContext_t;

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */
/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */
/* g_rawimu_flush_req removed: its only consumer was APP_BLE_RawImuTimer_Callback,
   which is gone. Every DRDY edge now sets CFG_TASK_RAW_IMU_SEND_ID, so pending
   samples drain on the next sample regardless of state transitions. */
/* USER CODE END PM */


NO_INIT(uint32_t dyn_alloc_a[BLE_DYN_ALLOC_SIZE>>2]);

static BleApplicationContext_t bleAppCtx;

static const char a_GapDeviceName[] = {  'S', 'T', 'M', '3', '2', 'W', 'B', '0' }; /* Gap Device Name */

/**
 * Advertising Data
 */
uint8_t a_AdvData[] =
{
  2, AD_TYPE_FLAGS, FLAG_BIT_BR_EDR_NOT_SUPPORTED,
  14, AD_TYPE_COMPLETE_LOCAL_NAME, 'L', 'A', 'N', 'D', 'S', 'L', 'I', 'D', 'E', '_', 'E', 'W', 'S',  /* Complete name */

  3, AD_TYPE_16_BIT_SERV_UUID_CMPLT_LIST,
  0x01, 0xFF, //service uuid - 0xFF01

  /* Manufacturer Specific Data (0xFF)
     length + 1(type) + 2(company id) + 1(alarm) + f2(counter) + 1(src) = 7
  */
  7, 0xFF,
  0xFF, 0xFF,   /* company id (demo) */
  0x00,         /* alarm */
  0x00,      /* vel */
  0x00,          /* dph */
  0x00

};

/* USER CODE BEGIN PV */

/* Devices allowed to connect --- [[[[[ UNCOMMENT ON PROD ]]]]] */
typedef struct {
	uint8_t address_type;
	uint8_t address[6];
} AcceptedDevice_t;

static const List_Entry_t s_accepted_devices[] = {
	{ 0x01, { 0x47, 0x4C, 0x53, 0x54, 0x52, 0xC0 }},   // Gateway - ASCII for RTSLG
};

#define NUM_ACCEPTED_DEVICES (sizeof(s_accepted_devices)/sizeof(s_accepted_devices[0]))

static VTIMER_HandleType AlertTimerHandle;
static uint8_t g_in_alert_mode = 0;

/* TiltPollTimerHandle / RawImuTimerHandle removed - sampling is now driven by
   the IMU data-ready EXTI (see HAL_GPIO_EXTI_Callback). AlertTimerHandle stays:
   it is one-shot and low-rate, so it does not contend with radio scheduling. */

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
static void connection_complete_event(uint8_t Status,
                                      uint16_t Connection_Handle,
                                      uint8_t Peer_Address_Type,
                                      uint8_t Peer_Address[6],
                                      uint16_t Connection_Interval,
                                      uint16_t Peripheral_Latency,
                                      uint16_t Supervision_Timeout);

static void gap_cmd_resp_wait(void);
static void gap_cmd_resp_release(void);

/* USER CODE BEGIN PFP */
static void APP_BLE_TiltPoll_Task(void);

/* USER CODE END PFP */

/* External variables --------------------------------------------------------*/

/* USER CODE BEGIN EV */

/* USER CODE END EV */

/* Private functions ---------------------------------------------------------*/

/* USER CODE BEGIN PF */
static void APP_BLE_RawImuSend_Task(void)
{
    (void)Landslide_Send_Next_Pending();
}
/* USER CODE END PF */

/* Functions Definition ------------------------------------------------------*/
void ModulesInit(void)
{
  BLENVM_Init();
  if (PKAMGR_Init() == PKAMGR_ERROR)
  {
    Error_Handler();
  }
}

void BLE_Init(void)
{
  uint8_t role;
  uint8_t privacy_type = 0;
  tBleStatus ret;
  uint16_t gatt_service_changed_handle;
  uint16_t gap_dev_name_char_handle;
  uint16_t gap_appearance_char_handle;
  uint16_t gap_periph_pref_conn_param_char_handle;
  uint8_t bd_address[6] = {0};
  uint8_t bd_address_len= 6;
  uint16_t appearance = CFG_GAP_APPEARANCE;

  BLE_STACK_InitTypeDef BLE_STACK_InitParams = {
    .BLEStartRamAddress = (uint8_t*)dyn_alloc_a,
    .TotalBufferSize = BLE_DYN_ALLOC_SIZE,
    .NumAttrRecords = CFG_BLE_NUM_GATT_ATTRIBUTES,
    .MaxNumOfClientProcs = CFG_BLE_NUM_OF_CONCURRENT_GATT_CLIENT_PROC,
    .NumOfRadioTasks = CFG_BLE_NUM_RADIO_TASKS,
    .NumOfEATTChannels = CFG_BLE_NUM_EATT_CHANNELS,
    .NumBlockCount = CFG_BLE_MBLOCKS_COUNT,
    .ATT_MTU = CFG_BLE_ATT_MTU_MAX,
    .MaxConnEventLength = CFG_BLE_CONN_EVENT_LENGTH_MAX,
    .SleepClockAccuracy = CFG_BLE_SLEEP_CLOCK_ACCURACY,
    .NumOfAdvDataSet = CFG_BLE_NUM_ADV_SETS,
    .NumOfSubeventsPAwR = CFG_BLE_NUM_PAWR_SUBEVENTS,
    .MaxPAwRSubeventDataCount = CFG_BLE_PAWR_SUBEVENT_DATA_COUNT_MAX,
    .NumOfAuxScanSlots = CFG_BLE_NUM_AUX_SCAN_SLOTS,
    .FilterAcceptListSizeLog2 = CFG_BLE_FILTER_ACCEPT_LIST_SIZE_LOG2,
    .L2CAP_MPS = CFG_BLE_COC_MPS_MAX,
    .L2CAP_NumChannels = CFG_BLE_COC_NBR_MAX,
    .NumOfSyncSlots = CFG_BLE_NUM_SYNC_SLOTS,
    .CTE_MaxNumAntennaIDs = CFG_BLE_NUM_CTE_ANTENNA_IDS_MAX,
    .CTE_MaxNumIQSamples = CFG_BLE_NUM_CTE_IQ_SAMPLES_MAX,
    .NumOfSyncBIG = CFG_BLE_NUM_SYNC_BIG_MAX,
    .NumOfBrcBIG = CFG_BLE_NUM_BRC_BIG_MAX,
    .NumOfSyncBIS = CFG_BLE_NUM_SYNC_BIS_MAX,
    .NumOfBrcBIS = CFG_BLE_NUM_BRC_BIS_MAX,
    .NumOfCIG = CFG_BLE_NUM_CIG_MAX,
    .NumOfCIS = CFG_BLE_NUM_CIS_MAX,
    .isr0_fifo_size = CFG_BLE_ISR0_FIFO_SIZE,
    .isr1_fifo_size = CFG_BLE_ISR1_FIFO_SIZE,
    .user_fifo_size = CFG_BLE_USER_FIFO_SIZE
  };

  ret = BLE_STACK_Init(&BLE_STACK_InitParams);
  if (ret != BLE_STATUS_SUCCESS) {
    APP_DBG_MSG("Error in BLE_STACK_Init() 0x%02x\r\n", ret);
    Error_Handler();
  }

  ret = hci_le_set_default_phy(0, HCI_TX_PHYS_LE_1M_PREF, HCI_TX_PHYS_LE_1M_PREF);
    if (ret != BLE_STATUS_SUCCESS) {
        SEGGER_RTT_printf(0, "hci_le_set_default_phy failed: 0x%02X\n", ret);
    }

