samiparyal/LandslideEWS_lowpow/STM32_BLE/App/app_ble.c
	if (imu_poll() != 0)
	{
		/* No fresh sample. Nothing to re-arm: the next DRDY edge re-triggers
		   this task by itself. */
		return;
	}

	float tilt_deg = last_valid_tilt_deg;
	float gyro_mag = 0.0f;
	float acceleration_magnitude_g = 1.0f;

	if (imu_compute_tilt_deg(&tilt_deg) == 0)
	{
		last_valid_tilt_deg = tilt_deg;
	}
	else
	{
		tilt_deg = last_valid_tilt_deg;
	}


	//imu_get_gyro_dps_magnitude(&gyro_mag);   -- gyro turned off for battery save
	(void)imu_get_acceleration_magnitude_g(&acceleration_magnitude_g);

	uint8_t gyro_was_off = (!TRAINING_MODE_ENABLED && tilt_detector_get_state() == TILT_STATE_NORMAL) ? 1U : 0U;

	/* dt must be the REAL DRDY period, not the requested interval -- the ODR
	   ladder quantizes hard (NORMAL asks 1000 ms, gets 533 ms). Accumulate the
	   sub-millisecond remainder so the integrated time stays exact rather than
	   drifting a few % per sample. */
	static uint32_t dt_remainder_us = 0;
	uint32_t period_us = imu_get_actual_period_us();
	if (period_us == 0U) period_us = armed_interval_ms * 1000U;   /* pre-init fallback */
	dt_remainder_us += period_us;
	uint32_t dt_ms = dt_remainder_us / 1000U;
	dt_remainder_us -= dt_ms * 1000U;

	TiltState_t state = tilt_detector_update(tilt_deg, gyro_mag, acceleration_magnitude_g, dt_ms);

	float deviation = tilt_detector_get_deviation();
	float velocity  = tilt_detector_get_rate_dph();
	uint16_t dev_x100_buf = (uint16_t)(deviation * 100.0f + 0.5f);
	uint16_t vel_x100_buf = (uint16_t)(velocity  * 100.0f + 0.5f);
	(void)Landslide_Buffer_Sample(dev_x100_buf, vel_x100_buf, gyro_was_off);

	if(was_calibrating)
	{
		static uint8_t last_pct = 0;
		uint8_t pct = tilt_detector_get_calib_percent();
		if(pct != last_pct && (pct % 10) == 0)
		{
			last_pct = pct;
			SEGGER_RTT_printf(0, "[Calibrating] %d%%\n", pct);
			Landslide_Update_Alert_Status((uint8_t)TILT_STATE_CALIBRATING, TRIGGER_NONE);
		}
		if (pct == 100)
		{
			float baseline = tilt_detector_get_baseline();
			int bas_int  = (int)baseline;
			int bas_frac = (int)((baseline - (float)bas_int) * 100.0f);
			SEGGER_RTT_printf(0, "Calibration complete. Baseline = %d.%02d deg\n", bas_int, bas_frac);

			HAL_GPIO_WritePin(LED_GPIO_Port, LED_Pin, GPIO_PIN_SET);
		}
		was_calibrating = (state == TILT_STATE_CALIBRATING);
	}
	else
	{
	    int dev_int  = (int)deviation;
		int dev_frac = (int)((deviation - (float)dev_int) * 100.0f);
		int vel_int  = (int)velocity;
		int vel_frac = (int)((velocity - (float)vel_int) * 100.0f);

		static float last_rate = -1.0f;
		if (velocity != last_rate)
		{
			last_rate = velocity;
			SEGGER_RTT_printf(0, "[Rate] %d.%02d deg/h  (dev=%d.%02d)\n", vel_int, vel_frac, dev_int, dev_frac);
		}

		static TiltState_t last_printed_state = TILT_STATE_CALIBRATING;
		if(state != last_printed_state)
		{
		    last_printed_state = state;
		}

		static TiltState_t last_state = TILT_STATE_CALIBRATING;
		static uint8_t     last_src_deg     = 0;
		static uint8_t     last_vel_x100_b  = 0;
		static uint8_t     last_trigger     = 0;

		uint8_t cur_src_deg    = (uint8_t)deviation;
		float   cur_velocity   = tilt_detector_get_rate_dph();
		uint8_t cur_vel_x100_b = (uint8_t)(cur_velocity * 100.0f > 255.0f ? 255 : (uint8_t)(cur_velocity * 100.0f));
		uint8_t cur_trigger    = tilt_detector_get_trigger_reason();

		uint8_t data_changed = (state != last_state) ||
		                       (cur_src_deg    != last_src_deg)    ||
		                       (cur_vel_x100_b != last_vel_x100_b) ||
		                       (cur_trigger    != last_trigger);

		if (data_changed)
		{
			 uint8_t state_transitioned = (state != last_state) && (last_state != TILT_STATE_CALIBRATING);

			last_state      = state;
			last_src_deg     = cur_src_deg;
			last_vel_x100_b  = cur_vel_x100_b;
			last_trigger     = cur_trigger;

			APP_BLE_AlarmAdvUpdate((uint8_t)state, (uint8_t)deviation);

			if (state_transitioned)
			{
			    Landslide_Mark_Pending_As_Historical();

				/* Backlog now drains one Landslide_Send_Next_Pending() call per
				   DRDY edge. A transition into WARNING/CRITICAL also raises the
				   ODR, so the replay rate rises with it. */
			}
		}

		static uint32_t last_broadcast = 0;
		uint32_t now = HAL_GetTick();

		uint32_t interval;
		if (state == TILT_STATE_CRITICAL)      interval = BROADCAST_CRITICAL_MS;
		else if (state == TILT_STATE_WARNING)  interval = BROADCAST_WARNING_MS;
		else                                   interval = BROADCAST_NORMAL_MS;

		if((now-last_broadcast)>=interval)
		{
			last_broadcast = now;
			APP_BLE_AlarmAdvUpdate((uint8_t)state, (uint8_t)deviation);
			SEGGER_RTT_printf(0, "[Broadcast] level=%d  dev=%d.%02d deg\n", (int)state, dev_int, dev_frac);
		}
	}

	/* Sampling cadence is now the sensor ODR, not a timer. Instead of arming a
	   virtual timer we re-rate the IMU: imu_set_rate_ms() picks the ODR, and
	   the resulting DRDY edge rate becomes the poll rate. dt_ms for the
	   detector tracks whatever we last asked for. */
	uint32_t next_interval;
	if (TRAINING_MODE_ENABLED)
	{
		next_interval = TRAINING_MODE_RATE_MS;
	}
	else if (state == TILT_STATE_CALIBRATING) next_interval = POLL_INTERVAL_CALIB_MS;
	else if (state == TILT_STATE_CRITICAL)    next_interval = POLL_INTERVAL_CRITICAL_MS;
	else if (state == TILT_STATE_WARNING)     next_interval = POLL_INTERVAL_WARNING_MS;
	else                                      next_interval = POLL_INTERVAL_NORMAL_MS;

	if (next_interval != armed_interval_ms)
	{
		armed_interval_ms = next_interval;
		(void)imu_set_rate_ms(next_interval);   /* no-ops if unchanged */
	}
}

void APP_BLE_AlarmAdvUpdate(uint8_t alarm, uint8_t src)
{
	float velocity     = tilt_detector_get_rate_dph();
	uint8_t vel_x100   = (uint8_t)(velocity * 100.0f > 255.0f ? 255 : (uint8_t)(velocity * 100.0f));

	a_AdvData[26] = alarm;
	a_AdvData[27] = src;
	a_AdvData[28] = vel_x100;
	a_AdvData[29] = tilt_detector_get_trigger_reason();

	tBleStatus status = aci_gap_set_advertising_data(0, ADV_COMPLETE_DATA, sizeof(a_AdvData), (uint8_t*)a_AdvData);

	if(status != BLE_STATUS_SUCCESS)
	{
		APP_DBG_MSG("aci_gap_set_advertising_data failed: 0x%02X\n", status);
	}

	if(bleAppCtx.BleApplicationContext_legacy.connectionHandle != 0xFFFF)
	{
		uint16_t dev_x100_16 = (uint16_t)(tilt_detector_get_deviation() * 100.0f + 0.5f);
		uint16_t vel_x100_16 = (uint16_t)(tilt_detector_get_rate_dph() * 100.0f + 0.5f);
		Landslide_Update_Tilt_Data(dev_x100_16, vel_x100_16);
		Landslide_Update_Alert_Status(alarm, tilt_detector_get_trigger_reason());
	}

	if (alarm == TILT_STATE_CRITICAL && !g_in_alert_mode)
	{
		g_in_alert_mode=1;
		if(bleAppCtx.BleApplicationContext_legacy.connectionHandle == 0xFFFF)
		{
			APP_BLE_Procedure_Gap_Peripheral(PROC_GAP_PERIPH_ADVERTISE_STOP);
			APP_BLE_Procedure_Gap_Peripheral(PROC_GAP_PERIPH_ADVERTISE_START_FAST);

			AlertTimerHandle.callback = APP_BLE_RadioTimer_Callback;
			HAL_RADIO_TIMER_StartVirtualTimer(&AlertTimerHandle, FAST_ADV_DURATION_MS);
		}
	}
	else if (alarm < TILT_STATE_CRITICAL && g_in_alert_mode)
	{
		if(bleAppCtx.BleApplicationContext_legacy.connectionHandle == 0xFFFF)
		{
			APP_BLE_Procedure_Gap_Peripheral(PROC_GAP_PERIPH_ADVERTISE_STOP);
			APP_BLE_Procedure_Gap_Peripheral(PROC_GAP_PERIPH_ADVERTISE_START_LP);
		}
	}
}

void APP_BLE_AlertTimeout(void)
{
	if(g_in_alert_mode)
	{
			  g_in_alert_mode = 0;
			  if(bleAppCtx.BleApplicationContext_legacy.connectionHandle == 0xFFFF)
			 {
			  APP_BLE_Procedure_Gap_Peripheral(PROC_GAP_PERIPH_ADVERTISE_STOP);
			  APP_BLE_Procedure_Gap_Peripheral(PROC_GAP_PERIPH_ADVERTISE_START_LP);
			  }
		}
}

void APP_BLE_RadioTimer_Callback(void *context)
{
  UTIL_SEQ_SetTask(1U << CFG_TASK_ALARM_TIMEOUT_ID, CFG_SEQ_PRIO_1);
}

/* USER CODE END FD*/

static void gap_cmd_resp_release(void)
{
  UTIL_SEQ_SetEvt(1 << CFG_IDLEEVT_PROC_GAP_COMPLETE);
  return;
}

static void gap_cmd_resp_wait(void)
{
  UTIL_SEQ_WaitEvt(1 << CFG_IDLEEVT_PROC_GAP_COMPLETE);
  return;
}
